nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11-SoftHGNNn.yaml' will call yolo11-SoftHGNN.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024] 
  m: [0.50, 1.00, 512] 

# YOLO11-SoftHGNN backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] 
  - [-1, 1, Conv, [128, 3, 2]] 
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] 
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] 
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] 
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] 
  - [-1, 2, C2PSA, [1024]]

# YOLO11-SoftHGNN head
head:
  - [[4, 6, 10], 1, F2SoftHG, [1, True, True, 1, 0.5]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [11, 1, ShapeAlignConv, []]
  - [[6, 11], 1, MergeConv, []]  
  - [[4, 12], 1, MergeConv, []] 
  - [[10, 13], 1, MergeConv, []]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] 

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 15], 1, Concat, [1]] 
  - [-1, 2, C3k2, [256, False]] 

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 19], 1, Concat, [1]] 
  - [-1, 2, C3k2, [512, False]] 

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024, True]] 

  - [[22, 25, 28], 1, Detect, [nc]] 
